app/controllers/v1/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    books = Book.all

INSERT INTO "books" ("title", "author", "weight", "publisher", "language", "pages", "publication_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    book = Book.new(book_params)
    if book.save